Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `quarkus.oidc.token-state-manager.encryption-required` and two other related properties, `quarkus.oidc.token-state-manager.encryption-secret` and `quarkus.oidc.token-state-manager.encryption-algorithm`, are also effective when custom `io.quarkus.oidc.TokenStateManager` is used, including xref:security-oidc-code-flow-authentication.adoc#db-token-state-manager[Database TokenStateManager] and xref:security-oidc-code-flow-authentication.adoc#redis-token-state-manager[Redis TokenStateManager].
ja_jp: `quarkus.oidc.token-state-manager.encryption-required` と他の 2 つの関連プロパティー、`quarkus.oidc.token-state-manager.encryption-secret` および `quarkus.oidc.token-state-manager.encryption-algorithm` は、xref:security-oidc-code-flow-authentication.adoc#db-token-state-manager[Database TokenStateManager] や xref:security-oidc-code-flow-authentication.adoc#redis-token-state-manager[Redis TokenStateManager] を含む、カスタムの `io.quarkus.oidc.TokenStateManager` が使用される場合にも有効です。

source: `quarkus.oidc.token-state-manager.encryption-secret` should be configured if Quarkus authenticates to OpenId Connect Provider using either mTLS or `private_key_jwt` (where a private RSA or EC key is used to sign a JWT token) authentication methods, otherwise a random key will be generated which will be problematic if the Quarkus application is running in the cloud with multiple pods managing the requests.
ja_jp: QuarkusがmTLSまたは （JWTトークンに署名するためにRSAまたはECの秘密鍵が使用される） `private_key_jwt` 認証方法を使用してOpenID Connect Providerを認証する場合、 `quarkus.oidc.token-state-manager.encryption-secret` を設定する必要があります。そうでない場合、ランダムな鍵が生成されるため、Quarkusアプリケーションが複数のポッドでリクエストを管理しているクラウドで実行されている場合に問題となります。

source: `quarkus.oidc.token-state-manager.strategy` can be used to optimize the token storage by not storing the tokens your application does not intend to use.
ja_jp: `quarkus.oidc.token-state-manager.strategy` を使用すると、アプリケーションが使用する予定のないトークンを保存しないようにすることで、トークンストレージを最適化できます。

source: `quarkus.oidc.token.age` property can be used to enforce how long an otherwise valid token can be used for. For example, some providers may issue tokens that are valid for several months - what if you do not want your users be able to access Quarkus with access tokens valid for a very long time ? In this case you can set a token age to some reasonable value such as 1 day, etc.
ja_jp: `quarkus.oidc.token.age` プロパティーを使用すると、有効なトークンをどのくらいの期間使用できるかを強制できます。たとえば、一部のプロバイダーは数ヶ月間有効なトークンを発行することがありますが、ユーザーが非常に長期間有効なアクセストークンで Quarkus にアクセスできるようにしたくない場合はどうすればよいでしょうか。このような場合、トークンの有効期間を 1 日などの妥当な値に設定できます。

source: `quarkus.oidc.token.allow-opaque-token-introspection` is a hardening type of property. Quarkus OIDC attempts to verify any access token which comes its way by default. But if you deal with JWT tokens, especially if you prefer to verify them only locally with `quarkus.oidc.token.allow-jwt-introspection=false`, then what if someone sends a binary (opaque) access token which your application does not really expect ? Setting `quarkus.oidc.token.allow-opaque-token-introspection=false` prevents possibly disruptive remote introspection calls and causes an immediate verification error when an opaque token is received.
ja_jp: `quarkus.oidc.token.allow-opaque-token-introspection` は、セキュリティーを強化するためのプロパティーです。Quarkus OIDC はデフォルトで、送られてくるあらゆるアクセストークンの検証を試みます。しかし、JWT トークンを扱う場合、特に `quarkus.oidc.token.allow-jwt-introspection=false` でローカルのみでの検証を優先している場合に、アプリケーションが想定していないバイナリ (不透明) アクセストークンが送信されたらどうなるでしょうか。`quarkus.oidc.token.allow-opaque-token-introspection=false` を設定することで、混乱を招く可能性のあるリモートイントロスペクションの呼び出しを防止し、不透明トークンを受信した際に即座に検証エラーを発生させることができます。

source: `quarkus.oidc.token.binding.certificate=true` can be used to constrain the bearer access token to the MTLS client which is sending it as described in the https://datatracker.ietf.org/doc/html/rfc8705[RFC 8705: Mutual TLS token binding] specification.
ja_jp: `quarkus.oidc.token.binding.certificate=true` を使用すると、 https://datatracker.ietf.org/doc/html/rfc8705[RFC 8705: Mutual TLS token binding] 仕様に記載されているように、ベアラーアクセストークンを送信元の MTLS クライアントに制限できます。

source: `quarkus.oidc.token.customizer-name` is an advanced property that may be used to select a specific `io.quarkus.oidc.TokenCustomizer` implementation which can pre-process JWT token headers before its signature can be verified. The main use-case is to support verifying legacy Azure JWT tokens which must have their `nonce` header recalculated for the signature verification to succeed.
ja_jp: `quarkus.oidc.token.customizer-name` は、署名の検証前に JWT トークンのヘッダーを前処理できる特定の `io.quarkus.oidc.TokenCustomizer` 実装を選択するために使用される高度なプロパティーです。主なユースケースは、署名検証を成功させるために `nonce` ヘッダーを再計算する必要があるレガシーな Azure JWT トークンの検証サポートです。

source: `quarkus.oidc.token.header` and `quarkus.oidc.token.authorization-scheme` can be used to customize which HTTP header contains a bearer access token. You can customize the header and, when the HTTP `Authorization` is used - the scheme.
ja_jp: どの HTTP ヘッダーにベアラーアクセストークンを含めるかをカスタマイズするために、 `quarkus.oidc.token.header` と `quarkus.oidc.token.authorization-scheme` を使用できます。ヘッダーをカスタマイズでき、HTTP `Authorization` が使用される場合はスキームもカスタマイズ可能です。

source: `quarkus.oidc.token.issued-at-required` can be set to `false` when you have to deal with the providers which do not set a token `issued at time` (`iat`) claim.
ja_jp: `quarkus.oidc.token.issued-at-required` は、トークンの `発行時刻` (`iat`) クレームを設定しないプロバイダーを扱う必要がある場合に `false` に設定できます。

source: `quarkus.oidc.token.lifespan-grace` property should only be used to avoid token verification failures due to the possible clock skews.
ja_jp: `quarkus.oidc.token.lifespan-grace` プロパティーは、発生しうるクロックスキューによるトークン検証の失敗を避けるためだけにのみ使用されるべきです。

source: `quarkus.oidc.token.principal-claim` can be used to customize which token claim should be used to support Java Security `Principal` and MicroProfile JWT `JsonWebToken` APIs for getting the principal name. The `upn`, `preferred_username`, `sub` are some of the claims that are used to find the principal name by default, but some tokens may have it in the `name` or some other claim, which is when you can set `quarkus.oidc.token.principal-claim=name`, etc.
ja_jp: `quarkus.oidc.token.principal-claim` を使用すると、Java Security `Principal` および MicroProfile JWT `JsonWebToken` API でプリンシパル名を取得する際に使用されるトークンクレームをカスタマイズできます。デフォルトでは、`upn`、`preferred_username`、`sub` といったクレームがプリンシパル名の検索に使用されますが、一部のトークンでは `name` またはその他のクレームに含まれている場合があります。その場合、`quarkus.oidc.token.principal-claim=name` などと設定できます。

source: `quarkus.oidc.token.refresh-expired` can be used to enable automatic user session renewal when the user session has expired and the refresh token is available. This property is not enabled by default because with the automatic renewal, the user, after authenticating once, may not be asked to re-authenticate for a very long time. Therefore an admin level decision may be required to enable an automatic session renewal.
ja_jp: `quarkus.oidc.token.refresh-expired` を使用すると、ユーザーセッションが期限切れになり、リフレッシュトークンが利用可能な場合に、ユーザーセッションの自動更新を有効にできます。自動更新を有効にすると、ユーザーは一度認証された後、非常に長い間再認証を求められない可能性があるため、このプロパティーはデフォルトでは有効になっていません。したがって、自動セッション更新を有効にするには、管理者レベルの判断が必要になる場合があります。

source: `quarkus.oidc.token.refresh-token-time-skew` can be used to force the refresh when it is allowed with `quarkus.oidc.token.refresh-expired` and the ID token in the session cookie is still valid. You can use this property to request the refresh if a still valid ID token is due to expire within the next hour. If you would like to auto-refresh user sessions, then having this property minimizes the risk of the user missing out on the session refresh if the session cookie itself got expired and removed by the browser. When you use SPA, you can have a background thread pinging Quarkus periodically, leading to a session refresh once Quarkus determines the ID token will expire soon within a configured `quarkus.oidc.token.refresh-token-time-skew` period of time.
ja_jp: `quarkus.oidc.token.refresh-token-time-skew` は、`quarkus.oidc.token.refresh-expired` で許可されており、かつセッション Cookie 内の ID トークンがまだ有効である場合に、リフレッシュを強制するために使用できます。このプロパティーを使用すると、まだ有効な ID トークンが今後 1 時間以内に期限切れになる予定の場合にリフレッシュを要求できます。ユーザーセッションを自動リフレッシュしたい場合、このプロパティーを設定することで、セッション Cookie 自体が期限切れになりブラウザーによって削除されることでユーザーがセッションのリフレッシュを逃すリスクを最小限に抑えることができます。SPA を使用している場合は、バックグラウンドスレッドで定期的に Quarkus に ping を送信し、設定された `quarkus.oidc.token.refresh-token-time-skew` 期間内に ID トークンがまもなく期限切れになると Quarkus が判断した時点でセッションリフレッシュを行うことができます。

source: `quarkus.oidc.token.required-claims` map property can be used to provide an additional simple check that the token contains specific string claim values.
ja_jp: `quarkus.oidc.token.required-claims` マッププロパティーを使用すると、トークンに特定の文字列クレーム値が含まれているかどうかの追加の簡単なチェックを提供できます。

source: `quarkus.oidc.token.subject-required` can be used to enforce that a token has a unique subject value. If your provider allocates a subject to the token then requiring it is RECOMMENDED, especially when you deal with multiple OIDC and OAuth2 providers and would like to get a unique user identifier. This property is not set by defaul since some providers may not always set it. For example, a Keycloak lightweight access token may not have a subject (`sub`) claim set.
ja_jp: `quarkus.oidc.token.subject-required` を使用して、トークンが一意のサブジェクト値を持つことを強制できます。プロバイダーがトークンにサブジェクトを割り当てる場合は、特に複数の OIDC および OAuth2 プロバイダーを扱い、一意のユーザー識別子を取得したい場合に、これを必須にすることが推奨されます。一部のプロバイダーは常にこれを設定するとは限らないため、このプロパティーはデフォルトでは設定されていません。たとえば、Keycloak の軽量アクセストークンにはサブジェクト (`sub`) クレームが含まれない場合があります。

source: `quarkus.oidc.token.token-type` can be used to enforce the token type when you know the provider sets a type (`typ`) claim. For example, Keycloak issues the ID token, access token and refresh token in JWT format, how how can you prevent SPA sending an ID token to Quarkus as if it were a bearer access token ? Setting `quarkus.oidc.token.token-type=bearer` enforces that only a JWT access token that contains a type (`typ`) claim with the `bearer` value can be accepted.
ja_jp: `quarkus.oidc.token.token-type` は、プロバイダーがタイプ (`typ`) クレームを設定することがわかっている場合に、トークンタイプを強制するために使用できます。たとえば、Keycloak は JWT 形式で ID トークン、アクセストークン、リフレッシュトークンを発行しますが、SPA が ID トークンをベアラーアクセストークンであるかのように Quarkus に送信するのをどのように防ぐことができますか？ `quarkus.oidc.token.token-type=bearer` を設定すると、 `bearer` 値を持つタイプ (`typ`) クレームを含む JWT アクセストークンのみが受け入れられるように強制されます。

source: `quarkus.oidc.use-blocking-dns-lookup` should be set to `true` to avoid a Vert'x thread getting blocked when an OIDC provider connection is established on the slow network.
ja_jp: 低速なネットワークで OIDC プロバイダーとの接続が確立される際に Vert.x スレッドがブロックされるのを避けるため、 `quarkus.oidc.use-blocking-dns-lookup` は `true` に設定する必要があります。

source: `quarkus.oidc.user-info-path` is usually required after the <<authorization-code-flow> completion, when `UserInfo` must be requested to get more information about the user, in addition to what is already available in the ID token. Requesting `UserInfo` is also possible for the bearer access token flow.
ja_jp: `quarkus.oidc.user-info-path` は通常、 <<authorization-code-flow>> の完了後に、 ID トークンで既に利用可能な情報に加えて、ユーザーに関する詳細情報を得るために `UserInfo` をリクエストする必要がある場合に必要です。 `UserInfo` のリクエストは、ベアラーアクセストークンフローでも可能です。

source: `quarkus.pulsar.devservices.enabled` is set to `false`
ja_jp: `quarkus.pulsar.devservices.enabled` が `false` に設定されている

source: `quarkus.rabbitmq.devservices.enabled` is set to `false`
ja_jp: `quarkus.rabbitmq.devservices.enabled` が `false` に設定されていること

source: `quarkus.rest-client.<client-prefix>.follow-redirects` to enable redirection for a specific REST client.
ja_jp: `quarkus.rest-client.<client-prefix>.follow-redirects` で、特定のRESTクライアントに対するリダイレクトを有効にすることができます。

source: `quarkus.rest-client.client-prefix.connect-timeout` to configure the connect timeout in milliseconds.
ja_jp: `quarkus.rest-client.client-prefix.connect-timeout` で、接続タイムアウトをミリ秒単位で設定します。

source: `quarkus.rest-client.client-prefix.max-redirects` to limit the number of redirects.
ja_jp: `quarkus.rest-client.client-prefix.max-redirects`でリダイレクトの回数を制限できます。

source: `quarkus.rest-client.follow-redirects` to enable redirection for all REST clients.
ja_jp: `quarkus.rest-client.follow-redirects` で、すべてのRESTクライアントに対してリダイレクトが有効になります。

source: `quarkus.smallrye-health.liveness-path` - The location of the liveness endpoint.
ja_jp: `quarkus.smallrye-health.liveness-path` - liveness エンドポイントの場所。

source: `quarkus.smallrye-health.root-path` - The location of the all-encompassing health endpoint.
ja_jp: `quarkus.smallrye-health.root-path` - すべてを網羅したヘルスエンドポイントの場所。

source: `quarkus.test.profile.tags=foo`: In this case none of tests will be executed because none of the tags defined on the `QuarkusTestProfile` implementations match the value of `quarkus.test.profile.tags`. Note that `NoQuarkusProfileTest` is not executed either because it is not annotated with `@TestProfile`.
ja_jp: `quarkus.test.profile.tags=foo`: この場合、 `QuarkusTestProfile` 実装で定義されたタグはいずれも `quarkus.test.profile.tags` の値と一致しないため、テストは実行されません。 `@TestProfile` でアノテーションが付けられていないため、 `NoQuarkusProfileTest` も実行されないことに注意してください。

source: `quarkus.test.profile.tags=test1,test3`: This case results in the same tests being executed as the previous case.
ja_jp: `quarkus.test.profile.tags=test1,test3`: この場合、前の場合と同じテストが実行されます。

source: `quarkus.test.profile.tags=test1`: In this case `SingleTagTest` and `MultipleTagsTest` will be run because the tags on their respective `QuarkusTestProfile` implementations match the value of `quarkus.test.profile.tags`.
ja_jp: `quarkus.test.profile.tags=test1`: この場合、それぞれの `QuarkusTestProfile` 実装のタグが `quarkus.test.profile.tags` の値と一致するため、 `SingleTagTest` と `MultipleTagsTest` が実行されます。

source: `quarkus.test.profile.tags=test2,test3`: In this case only `MultipleTagsTest` will be run because `MultipleTagsTest` is the only `QuarkusTestProfile` implementation whose `tags` method matches the value of `quarkus.test.profile.tags`.
ja_jp: `quarkus.test.profile.tags=test2,test3`: この場合、 `MultipleTagsTest` は、 `tags` メソッドが `quarkus.test.profile.tags` の値と一致する唯一の `QuarkusTestProfile` 実装であるため、 `MultipleTagsTest` のみ実行されます。

source: `quarkus.test.profile.tags` is not set: All tests will be executed.
ja_jp: `quarkus.test.profile.tags` が設定されていない: すべてのテストが実行されます。

source: `quarkus.tools.config` system property is checked, if it exists, its value will be used as a path to the registry client configuration file;
ja_jp: `quarkus.tools.config` システムプロパティがチェックされ、存在すればその値がレジストリクライアント設定ファイルへのパスとして使用されます。

source: `quarkus:dev` output
ja_jp: `quarkus:dev` 出力

source: `quarkus:dev` runs Quarkus in development mode. This enables live reload with background compilation, which means that when you modify your Java files and/or your resource files and refresh your browser, these changes will automatically take effect. This works too for resource files like the configuration property file. Refreshing the browser triggers a scan of the workspace, and if any changes are detected, the Java files are recompiled and the application is redeployed; your request is then serviced by the redeployed application. If there are any issues with compilation or deployment an error page will let you know.
ja_jp: `quarkus:dev` は、開発モードで Quarkus を実行します。これにより、Java ファイルやリソースファイルを変更してブラウザを更新すると、これらの変更が自動的に反映されます。 これは、設定プロパティーファイルなどのリソースファイルに対しても機能します。 ブラウザをリフレッシュすると、ワークスペースのスキャンがトリガーされ、変更が検出された場合、Java ファイルが再コンパイルされ、アプリケーションが再デプロイされます。リクエストは、再デプロイされたアプリケーションによって処理されます。コンパイルやデプロイに問題がある場合は、エラーページで通知します。

source: `quarkus:info` will also highlight basic Quarkus dependency version misalignments, in case they are detected. For example, if we modify the project mentioned above by removing the `camel-quarkus-rabbitmq` extension from the dependencies and adding a `2.6.3.Final` `<version>` element to the `quarkus-rest` dependency that is managed by the `quarkus-bom` and then run `quarkus:info` again, we'll see something like:
ja_jp: `quarkus:info` は、Quarkusの基本的な依存関係のバージョンのずれが検出された場合、そのハイライトも行います。例えば、依存関係から `camel-quarkus-rabbitmq` エクステンションを削除し、 `quarkus-bom` によって管理されている `quarkus-rest` 依存関係に `2.6.3.Final` `<version>` 要素を追加することで、前述のプロジェクトを修正し、 `quarkus:info` を再度実行すると、次のように表示されます:

source: `quarkus:info` will also highlight basic Quarkus dependency version misalignments, in case they are detected. For example, if we modify the project mentioned above by removing the `camel-quarkus-rabbitmq` extension from the dependencies and adding a `2.6.3.Final` `<version>` element to the `quarkus-resteasy-reactive` dependency that is managed by the `quarkus-bom` and then run `quarkus:info` again, we'll see something like:
ja_jp: `quarkus:info` は、基本的なQuarkusの依存関係のバージョンのずれが検出された場合にも、それを強調表示します。例えば、上記のプロジェクトを修正して、依存関係から `camel-quarkus-rabbitmq` エクステンションを削除し、 `quarkus-bom` が管理している 依存関係に `quarkus-resteasy-reactive` `2.6.3.Final` `<version>` の要素を追加し、再度 `quarkus:info` を実行すると、次のような表示がされます:

source: `quarkus:info` will also highlight basic Quarkus dependency version misalignments, in case they are detected. For example, if we modify the project mentioned above by removing the `kogito-quarkus-decisions` extension from the dependencies and adding a `2.6.3.Final` `<version>` element to the `quarkus-resteasy-reactive` dependency that is managed by the `quarkus-bom` and then run `quarkus:info` again, we'll see something like:
ja_jp: `quarkus:info` は、Quarkus の基本的な依存関係のバージョンの不整合も検出された場合に強調表示します。たとえば、依存関係から `kogito-quarkus-decisions` エクステンションを削除し、 `2.6.3.Final` `<version>` 要素を `quarkus-bom` によって管理されている `quarkus-resteasy-reactive` の依存関係に追加することで上記のプロジェクトを変更し、再度 `quarkus:info` を実行すると、以下のようになります。

source: `quarkus:info` will also report Quarkus extensions that aren't found in the Quarkus extension registries if those are present among the project dependencies, indicating they have an 'unknown origin'.
ja_jp: また、 `quarkus:info` は、Quarkus エクステンションレジストリーにない Quarkus エクステンションがプロジェクトの依存関係に存在する場合は報告し、'不明なオリジン' であることを示します。

source: `quarkusDevRuntimeClasspathConfigurationDeployment` - Quarkus application dev mode runtime and build time dependencies.
ja_jp: `quarkusDevRuntimeClasspathConfigurationDeployment` - Quarkus アプリケーション開発モードのランタイムおよびビルドタイムの依存関係

source: `quarkusDevRuntimeClasspathConfiguration` - Quarkus application dev mode runtime dependencies;
ja_jp: `quarkusDevRuntimeClasspathConfiguration` - Quarkus アプリケーション開発モードのランタイム依存関係

source: `quarkusDev` enables hot deployment with background compilation, which means that when you modify your Java files or your resource files and refresh your browser these changes will automatically take effect. This works too for resource files like the configuration property file. The act of refreshing the browser triggers a scan of the workspace, and if any changes are detected the Java files are compiled, and the application is redeployed, then your request is serviced by the redeployed application. If there are any issues with compilation or deployment an error page will let you know.
ja_jp: `quarkusDev` は、バックグラウンドでのコンパイルによるホットデプロイを可能にします。つまり、Java ファイルやリソースファイルを変更してブラウザを更新すると、これらの変更が自動的に有効になります。これは、設定プロパティーファイルのようなリソースファイルにも適用されます。ブラウザをリフレッシュする行為は、ワークスペースのスキャンをトリガし、変更が検出された場合、Javaファイルがコンパイルされ、アプリケーションが再配置されると、あなたの要求は再配置されたアプリケーションによって処理されます。コンパイルやデプロイに問題がある場合は、エラーページでお知らせします。

source: `quarkusProdRuntimeClasspathConfigurationDeployment` - Quarkus application production runtime and build time dependencies;
ja_jp: `quarkusProdRuntimeClasspathConfigurationDeployment` - Quarkus アプリケーションのプロダクションランタイムとビルドタイムの依存関係

source: `quarkusProdRuntimeClasspathConfiguration` - Quarkus application production runtime dependencies;
ja_jp: `quarkusProdRuntimeClasspathConfiguration` - Quarkus アプリケーションのプロダクションランタイム依存関係

source: `quarkusTestRuntimeClasspathConfigurationDeployment` - Quarkus application test runtime and build time dependencies;
ja_jp: `quarkusTestRuntimeClasspathConfigurationDeployment` - Quarkus アプリケーションのテストランタイムとビルドタイムの依存関係

source: `quarkusTestRuntimeClasspathConfiguration` - Quarkus application test runtime dependencies;
ja_jp: `quarkusTestRuntimeClasspathConfiguration` - Quarkus アプリケーションのテストランタイム依存関係

source: `quarkus` - a namespace claimed by Quarkus which is a prefix for `@ConfigMapping` interfaces,
ja_jp: `quarkus` - Quarkusが主張する名前空間で、 `@ConfigMapping` インタフェースのプレフィックスです。

source: `quarkus` - a namespace claimed by Quarkus which is a prefix for all `@ConfigRoot` classes,
ja_jp: `quarkus` - Quarkus によって要求される名前空間で、すべての `@ConfigRoot` クラスの接頭辞。

source: `quarkus` for the default datasource or name of the datasource
ja_jp: デフォルトのデータソースは `quarkus`、もしくはデータソースの名前

source: `quote-requests` -> Kafka topic from which we read the quote requests
ja_jp: `quote-requests` -> この Kafka トピックから見積リクエストを読みます

source: `quote-requests` -> Pulsar topic from which we read the quote requests
ja_jp: `quote-requests` -> この Pulsar トピックから見積リクエストを読みます

source: `quote-requests` -> RabbitMQ queue from which we read the quote requests
ja_jp: `quote-requests` → 見積依頼を読み出すRabbitMQのキュー

source: `quotes` -> Kafka topic in which we write the quotes
ja_jp: `quotes` -> この Kafka トピックに見積を書き込みます

source: `quotes` -> Pulsar topic in which we write the quotes
ja_jp: `quotes` -> この Pulsar トピックに見積を書き込みます

source: `quotes` -> RabbitMQ exchange in which we write the quotes
ja_jp: `quotes` → 見積を書き込むRabbitMQのエクスチェンジ

source: `r` in dev mode (using continuous testing)
ja_jp: 開発モードで `r` （継続的テストを使用）

source: `readonly` is a named parameter.
ja_jp: `readonly` は名前付きパラメーターです。

source: `reconsume-later` sends the message to the https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#retry-letter-topic[retry letter topic] using the `reconsumeLater` API to be reconsumed with a delay. The delay can be configured using the `reconsumeLater.delay` property and defaults to 3 seconds. Custom delay or properties per message can be configured by adding an instance of `io.smallrye.reactive.messaging.pulsar.PulsarReconsumeLaterMetadata` to the failure metadata.
ja_jp: `reconsume-later` は、 `reconsumeLater` API を使用して、遅延して再消費されるメッセージを https://pulsar.apache.org/docs/3.0.x/concepts-messaging/#retry-letter-topic[再試行レタートピック] に送信します。 遅延は `reconsumeLater.delay` プロパティーを使用して設定でき、デフォルトは 3 秒です。 失敗メタデータに `io.smallrye.reactive.messaging.pulsar.PulsarReconsumeLaterMetadata` のインスタンスを追加することで、メッセージごとにカスタムの遅延またはプロパティーを設定できます。

source: `reject` - this strategy marks the AMQP message as rejected. The processing continues with the next message. Refer to the http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-rejected[rejected delivery state documentation].
ja_jp: `reject` - この戦略は、AMQP メッセージを拒否としてマークします。処理は次のメッセージに進みます。 http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-rejected[rejected delivery state documentation] を参照してください。

source: `reject` - this strategy marks the AMQP message as rejected. The processing continues with the next message. Refer to the https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-rejected[rejected delivery state documentation].
ja_jp: `reject` - この戦略は、AMQP メッセージを拒否としてマークします。処理は次のメッセージに進みます。 https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-rejected[rejected delivery state documentation] を参照してください。

source: `reject` - this strategy marks the RabbitMQ message as rejected (default). The processing continues with the next message.
ja_jp: `reject` - この戦略は、RabbitMQ メッセージを拒否済み (デフォルト) としてマークします。処理は次のメッセージに進みます。

source: `release` - this strategy marks the AMQP message as _released_. The processing continues with the next message. The broker can redeliver the message. Refer to the http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-released[released delivery state documentation].
ja_jp: `release` - この戦略は、AMQP メッセージを _released_ としてマークします。処理は次のメッセージに進みます。ブローカーはメッセージを再配信できます。 http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-released[released delivery state documentation] を参照してください。
